[
  {
    "stepDesc": "Heat the oil in a wok or nonstick skillet over medium-high heat. Crack the egg in and stir to mix the yolk with the white. When the egg is almost set, about 45 seconds, scramble it.",
    "recipeId": 1
  },
  {
    "stepDesc": "Add the rice, soy sauce and sesame oil, followed by the kimchi juice and kimchi. Stir and cook until the rice is heated through and evenly colored. Taste and add more soy sauce if necessary.",
    "recipeId": 1
  },
  {
    "stepDesc": "Scoop onto a plate, garnish with green onions and sesame seeds and serve immediately.",
    "recipeId": 1
  },
  {
    "stepDesc": "Combine 1/2 teaspoon cumin with 1 tablespoon of olive oil in a small bowl. Brush both sides of chops with the mixture and season them generously with salt and pepper. Set chops aside to let them come to room temperature while you prep the other ingredients",
    "recipeId": 1
  },
  {
    "stepDesc": "Scrub the potatoes, but don’t peel them. Cut into largish cubes and place in a microwave-safe container, along with 1 tablespoon of water. Microwave for 3 minutes; this will help them cook faster when added to the pan",
    "recipeId": 1
  },
  {
    "stepDesc": "Heat the remaining 2 tablespoons of olive oil in a large, lidded sauté pan or skillet over medium-high flame. Add chops to pan and brown on one side, about 4 minutes. Turn chops and reduce heat to medium. Cook for 2 minutes, then transfer to plate. If the lamb has produced a fair amount of fat (mine certainly did), pour off all but 2 tablespoons",
    "recipeId": 1
  },
  {
    "stepDesc": "Add onion to pan and cook, stirring often, until softening and translucent, about 3 minutes. Add garlic, remaining cumin, turmeric, and chili powder to pan and cook, stirring constantly, until fragrant (really, really fragrant), about 45 seconds. Add chicken stock and water to pan, scraping up any browned bits. Add peas and potatoes to pan. Season with salt and pepper",
    "recipeId": 2
  },
  {
    "stepDesc": "Return chops to pan, along with any accumulated juices. Bring to a boil, then reduce heat to low and cover pan. Simmer until potatoes are tender, about 20 minutes. Plate chops and serve potatoes and peas around them",
    "recipeId": 2
  },
  {
    "stepDesc": "Toss zucchini and salt together in a large colander and place in sink to drain for 10 minutes.",
    "recipeId": 3
  },
  {
    "stepDesc": "Toss zucchini and salt together in a large colander and place in sink to drain for 10 minutes.",
    "recipeId": 3
  },
  {
    "stepDesc": "Put zucchini in the middle of a piece of cheesecloth; wrap cheesecloth around zucchini and squeeze to drain as much moisture from zucchini as possible.",
    "recipeId": 3
  },
  {
    "stepDesc": "Mix flour, Parmesan cheese, egg, garlic, kosher salt, and pepper together in a large bowl. Stir in zucchini.",
    "recipeId": 3
  },
  {
    "stepDesc": "Heat olive oil in a large skillet over medium-high heat.",
    "recipeId": 3
  },
  {
    "stepDesc": "Scoop batter by the tablespoon into the hot skillet and fry until golden brown, about 2 minutes per side.",
    "recipeId": 3
  },
  {
    "stepDesc": "Grease a large rimmed baking sheet or line with nonstick foil",
    "recipeId": 4
  },
  {
    "stepDesc": "Combine parsley, oil, rosemary, salt and garlic in a large bowl. Add squash and red pepper; toss until coated",
    "recipeId": 4
  },
  {
    "stepDesc": "Place mixture in a single layer in prepared pan",
    "recipeId": 4
  },
  {
    "stepDesc": "Bake, uncovered, at 425ºF, stirring occasionally, for 45 - 50 minutes or until squash and red pepper are tender and beginning to brown",
    "recipeId": 4
  },
  {
    "stepDesc": "Transfer to a serving dish and sprinkle with Parmesan cheese",
    "recipeId": 4
  },
  {
    "stepDesc": "Slice the onions into very thin half-moons using a mandolin, food processor or sharp knife",
    "recipeId": 2
  },
  {
    "stepDesc": "Cut the bacon into small pieces and fry in a 5-quart Dutch oven until the bacon is crispy.  Use a slotted spoon to remove the bacon pieces to paper towels to drain.  Turn off the heat and let the bacon grease cool for several minutes, then add the butter and let it melt",
    "recipeId": 2
  },
  {
    "stepDesc": " Turn the heat back to medium and add the onions.  Stir to coat the onions completely in the bacon fat and butter, then cover the pot.  Cook, stirring frequently, until the onions are soft and golden brown",
    "recipeId": 2
  },
  {
    "stepDesc": "When the onions are soft, stir in the marjoram and continue cooking, covered, until the onions are evenly golden.  Stir in the paprika and cook for five more minutes, making sure the onions don’t scorch.",
    "recipeId": 2
  },
  {
    "stepDesc": "Add the crushed tomatoes and stir, scraping up any browned bits on the bottom of the pot",
    "recipeId": 2
  },
  {
    "stepDesc": "Add half of the cooked bacon and cook until heated through",
    "recipeId": 2
  },
  {
    "stepDesc": "Pour in the chicken stock and bring to a boil.  Lower the heat, cover the pot and simmer for 20 minutes.",
    "recipeId": 2
  },
  {
    "stepDesc": "Taste for salt and pepper and add as needed. Just before serving, stir in the remaining bacon pieces",
    "recipeId": 2
  },
  {
    "stepDesc": "Slice the onions into very thin half-moons using a mandolin, food processor or sharp knife",
    "recipeId": 2
  },
  {
    "stepDesc": "Cut the bacon into small pieces and fry in a 5-quart Dutch oven until the bacon is crispy.  Use a slotted spoon to remove the bacon pieces to paper towels to drain.  Turn off the heat and let the bacon grease cool for several minutes, then add the butter and let it melt",
    "recipeId": 2
  },
  {
    "stepDesc": " Turn the heat back to medium and add the onions.  Stir to coat the onions completely in the bacon fat and butter, then cover the pot.  Cook, stirring frequently, until the onions are soft and golden brown",
    "recipeId": 2
  }

]